*** src/source/cdc/value.rs:31:5: replace epoch_days -> i32 with 1

*** mutation diff:
--- src/source/cdc/value.rs
+++ replace epoch_days -> i32 with 1
@@ -23,17 +23,17 @@
 use arrow::datatypes::{DataType, TimeUnit};
 use chrono::{NaiveDate, NaiveDateTime};
 use serde_json::Value as Json;
 
 use crate::error::Result;
 
 /// Days from the Unix epoch (1970-01-01) for `Date32`.
 fn epoch_days(d: NaiveDate) -> i32 {
-    (d - NaiveDate::from_ymd_opt(1970, 1, 1).expect("epoch")).num_days() as i32
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// A typed, owned CDC cell value.
 #[derive(Debug, Clone, PartialEq)]
 pub(crate) enum RivetValue {
     Null,
     Bool(bool),
     Int(i64),

*** result: Success
