*** src/source/cdc/value.rs:74:25: replace * with / in RivetValue::from_mysql

*** mutation diff:
--- src/source/cdc/value.rs
+++ replace * with / in RivetValue::from_mysql
@@ -66,17 +66,17 @@
             Value::Date(y, mo, d, h, mi, s, us) => {
                 NaiveDate::from_ymd_opt(*y as i32, *mo as u32, *d as u32)
                     .and_then(|date| date.and_hms_micro_opt(*h as u32, *mi as u32, *s as u32, *us))
                     .map_or(RivetValue::Null, RivetValue::DateTime)
             } // zero-date → null
             Value::Time(neg, days, h, mi, s, us) => {
                 let micros =
                     ((*days as i64 * 86_400 + *h as i64 * 3_600 + *mi as i64 * 60 + *s as i64)
-                        * 1_000_000)
+                        / /* ~ changed by cargo-mutants ~ */ 1_000_000)
                         + *us as i64;
                 RivetValue::TimeMicros(if *neg { -micros } else { micros })
             }
             Value::Bytes(b) => RivetValue::Bytes(b.clone()),
         }
     }
 
     /// Rough in-memory footprint of this cell — drives the sink's memory-budget

*** result: Success
