*** src/source/cdc/value.rs:75:25: replace + with * in RivetValue::from_mysql

*** mutation diff:
--- src/source/cdc/value.rs
+++ replace + with * in RivetValue::from_mysql
@@ -67,17 +67,17 @@
                 NaiveDate::from_ymd_opt(*y as i32, *mo as u32, *d as u32)
                     .and_then(|date| date.and_hms_micro_opt(*h as u32, *mi as u32, *s as u32, *us))
                     .map_or(RivetValue::Null, RivetValue::DateTime)
             } // zero-date → null
             Value::Time(neg, days, h, mi, s, us) => {
                 let micros =
                     ((*days as i64 * 86_400 + *h as i64 * 3_600 + *mi as i64 * 60 + *s as i64)
                         * 1_000_000)
-                        + *us as i64;
+                        * /* ~ changed by cargo-mutants ~ */ *us as i64;
                 RivetValue::TimeMicros(if *neg { -micros } else { micros })
             }
             Value::Bytes(b) => RivetValue::Bytes(b.clone()),
         }
     }
 
     /// Rough in-memory footprint of this cell — drives the sink's memory-budget
     /// rollover. Heap length for `Bytes`; the scalar width otherwise.

*** result: Success
