*** src/types/decimal.rs:101:39: replace - with + in decimal_str_to_scaled_i128

*** mutation diff:
--- src/types/decimal.rs
+++ replace - with + in decimal_str_to_scaled_i128
@@ -93,17 +93,17 @@
     };
 
     let frac_aligned: i128 = if scale_u == 0 {
         0
     } else if frac_part.len() < scale_u as usize {
         // Pad right with zeros: "0.1" with scale=2 → frac "10" → 10
         let mut buf = String::with_capacity(scale_u as usize);
         buf.push_str(frac_part);
-        for _ in 0..(scale_u as usize - frac_part.len()) {
+        for _ in 0..(scale_u as usize + /* ~ changed by cargo-mutants ~ */ frac_part.len()) {
             buf.push('0');
         }
         buf.parse().ok()?
     } else {
         // Truncate to exactly `scale` digits. If the source column truly has
         // scale=2 and a DB value arrives with more digits, that is either a
         // type mismatch or a DB rounding artefact — we preserve the declared
         // scale rather than silently extending it.

---- source::cdc::value::tests::decimal_parse_is_lossless stdout ----

thread 'source::cdc::value::tests::decimal_parse_is_lossless' (3789833) panicked at src/source/cdc/value.rs:1128:9:
assertion `left == right` failed
  left: Some(-57000)
 right: Some(-7500)

---- types::decimal::tests::frac_shorter_than_scale_is_right_padded stdout ----

thread 'types::decimal::tests::frac_shorter_than_scale_is_right_padded' (3790116) panicked at src/types/decimal.rs:249:9:
assertion `left == right` failed
  left: Some(10000)
 right: Some(100)

failures:
    source::cdc::value::tests::decimal_parse_is_lossless
    types::decimal::tests::frac_shorter_than_scale_is_right_padded

test result: FAILED. 1815 passed; 2 failed; 5 ignored; 0 measured; 0 filtered out; finished in 1.14s

*** result: Failure(101)
