*** src/types/decimal.rs:124:5: replace decimal_str_to_scaled_i256 -> Option<i256> with Some(Default::default())

*** mutation diff:
--- src/types/decimal.rs
+++ replace decimal_str_to_scaled_i256 -> Option<i256> with Some(Default::default())
@@ -116,62 +116,17 @@
         .checked_add(frac_aligned)?;
     Some(if negative { -result } else { result })
 }
 
 /// `Decimal256` analogue of [`decimal_str_to_scaled_i128`] — parses straight
 /// into `i256` so values beyond `i128` (precision 39–76) are not truncated.
 /// Returns `None` for empty / non-numeric strings or `i256` overflow.
 pub fn decimal_str_to_scaled_i256(s: &str, scale: i8) -> Option<i256> {
-    let s = s.trim();
-    if s.is_empty() {
-        return None;
-    }
-    let negative = s.starts_with('-');
-    let s = if negative {
-        &s[1..]
-    } else {
-        s.trim_start_matches('+')
-    };
-
-    if scale < 0 {
-        let divisor = pow10_i256(scale.unsigned_abs() as u32)?;
-        let int_val = i256::from_string(s.split('.').next()?.trim())?;
-        let result = int_val.checked_div(divisor)?;
-        return Some(if negative { -result } else { result });
-    }
-
-    let scale_u = scale as u32;
-    let (int_part, frac_part) = match s.find('.') {
-        Some(dot) => (&s[..dot], &s[dot + 1..]),
-        None => (s, ""),
-    };
-    let int_val = if int_part.is_empty() {
-        i256::ZERO
-    } else {
-        i256::from_string(int_part)?
-    };
-    let frac_aligned = if scale_u == 0 {
-        i256::ZERO
-    } else if frac_part.len() < scale_u as usize {
-        let mut buf = String::with_capacity(scale_u as usize);
-        buf.push_str(frac_part);
-        for _ in 0..(scale_u as usize - frac_part.len()) {
-            buf.push('0');
-        }
-        i256::from_string(&buf)?
-    } else {
-        i256::from_string(frac_part.get(..scale_u as usize)?)?
-    };
-
-    let scale_factor = pow10_i256(scale_u)?;
-    let result = int_val
-        .checked_mul(scale_factor)?
-        .checked_add(frac_aligned)?;
-    Some(if negative { -result } else { result })
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Scale an integer (already widened to `i128`) by `10^scale` into `i256` — the
 /// `Decimal256` analogue of the source drivers' `scale_int_to_i128`. `None` on
 /// negative scale or `i256` overflow.
 pub fn scale_int_to_i256(v: i128, scale: i8) -> Option<i256> {
     if scale < 0 {
         return None;

---- types::decimal::tests::i256_handles_values_beyond_i128 stdout ----

thread 'types::decimal::tests::i256_handles_values_beyond_i128' (4210812) panicked at src/types/decimal.rs:275:9:
assertion `left == right` failed
  left: 0
 right: 123456789012345678901234567890123456789012345

---- types::decimal::tests::i256_matches_i128_for_in_range_values stdout ----

thread 'types::decimal::tests::i256_matches_i128_for_in_range_values' (4210813) panicked at src/types/decimal.rs:292:13:
assertion `left == right` failed: i256 and i128 must agree for in-range value 123.45
  left: 0
 right: 12345

---- types::decimal::fuzz::decimal_parsers_total_and_exact stdout ----

thread 'types::decimal::fuzz::decimal_parsers_total_and_exact' (4210809) panicked at src/types/decimal.rs:326:5:
Test failed: assertion failed: `(left == right)` 
  left: `Some(0)`,
 right: `Some(1)` at src/types/decimal.rs:348.
minimal failing input: junk = "", int_part = 0, frac = 1, neg = false
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    types::decimal::fuzz::decimal_parsers_total_and_exact
    types::decimal::tests::i256_handles_values_beyond_i128
    types::decimal::tests::i256_matches_i128_for_in_range_values

test result: FAILED. 1814 passed; 3 failed; 5 ignored; 0 measured; 0 filtered out; finished in 1.80s

*** result: Failure(101)
