*** src/types/decimal.rs:135:14: replace < with <= in decimal_str_to_scaled_i256

*** mutation diff:
--- src/types/decimal.rs
+++ replace < with <= in decimal_str_to_scaled_i256
@@ -127,17 +127,17 @@
     }
     let negative = s.starts_with('-');
     let s = if negative {
         &s[1..]
     } else {
         s.trim_start_matches('+')
     };
 
-    if scale < 0 {
+    if scale <= /* ~ changed by cargo-mutants ~ */ 0 {
         let divisor = pow10_i256(scale.unsigned_abs() as u32)?;
         let int_val = i256::from_string(s.split('.').next()?.trim())?;
         let result = int_val.checked_div(divisor)?;
         return Some(if negative { -result } else { result });
     }
 
     let scale_u = scale as u32;
     let (int_part, frac_part) = match s.find('.') {

*** result: Success
