*** src/types/decimal.rs:135:14: replace < with > in decimal_str_to_scaled_i256

*** mutation diff:
--- src/types/decimal.rs
+++ replace < with > in decimal_str_to_scaled_i256
@@ -127,17 +127,17 @@
     }
     let negative = s.starts_with('-');
     let s = if negative {
         &s[1..]
     } else {
         s.trim_start_matches('+')
     };
 
-    if scale < 0 {
+    if scale > /* ~ changed by cargo-mutants ~ */ 0 {
         let divisor = pow10_i256(scale.unsigned_abs() as u32)?;
         let int_val = i256::from_string(s.split('.').next()?.trim())?;
         let result = int_val.checked_div(divisor)?;
         return Some(if negative { -result } else { result });
     }
 
     let scale_u = scale as u32;
     let (int_part, frac_part) = match s.find('.') {

---- types::decimal::tests::i256_matches_i128_for_in_range_values stdout ----

thread 'types::decimal::tests::i256_matches_i128_for_in_range_values' (4225410) panicked at src/types/decimal.rs:337:13:
assertion `left == right` failed: i256 and i128 must agree for in-range value 123.45
  left: 1
 right: 12345

---- types::decimal::tests::i256_handles_values_beyond_i128 stdout ----

thread 'types::decimal::tests::i256_handles_values_beyond_i128' (4225409) panicked at src/types/decimal.rs:327:9:
assertion `left == right` failed
  left: 123456789012345678901234567890123456789
 right: 123456789012345678901234567890123456789012345

---- types::decimal::fuzz::decimal_parsers_total_and_exact stdout ----

thread 'types::decimal::fuzz::decimal_parsers_total_and_exact' (4225406) panicked at src/types/decimal.rs:371:5:
Test failed: assertion failed: `(left == right)` 
  left: `Some(0)`,
 right: `Some(1)` at src/types/decimal.rs:393.
minimal failing input: junk = "", int_part = 0, frac = 1, neg = false
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    types::decimal::fuzz::decimal_parsers_total_and_exact
    types::decimal::tests::i256_handles_values_beyond_i128
    types::decimal::tests::i256_matches_i128_for_in_range_values

test result: FAILED. 1814 passed; 3 failed; 5 ignored; 0 measured; 0 filtered out; finished in 2.02s

*** result: Failure(101)
