*** src/types/decimal.rs:139:35: delete - in decimal_str_to_scaled_i256

*** mutation diff:
--- src/types/decimal.rs
+++ delete - in decimal_str_to_scaled_i256
@@ -131,17 +131,17 @@
     } else {
         s.trim_start_matches('+')
     };
 
     if scale < 0 {
         let divisor = pow10_i256(scale.unsigned_abs() as u32)?;
         let int_val = i256::from_string(s.split('.').next()?.trim())?;
         let result = int_val.checked_div(divisor)?;
-        return Some(if negative { -result } else { result });
+        return Some(if negative {  /* ~ changed by cargo-mutants ~ */result } else { result });
     }
 
     let scale_u = scale as u32;
     let (int_part, frac_part) = match s.find('.') {
         Some(dot) => (&s[..dot], &s[dot + 1..]),
         None => (s, ""),
     };
     let int_val = if int_part.is_empty() {

*** result: Success
