*** src/types/decimal.rs:144:41: replace + with - in decimal_str_to_scaled_i256

*** mutation diff:
--- src/types/decimal.rs
+++ replace + with - in decimal_str_to_scaled_i256
@@ -136,17 +136,17 @@
         let divisor = pow10_i256(scale.unsigned_abs() as u32)?;
         let int_val = i256::from_string(s.split('.').next()?.trim())?;
         let result = int_val.checked_div(divisor)?;
         return Some(if negative { -result } else { result });
     }
 
     let scale_u = scale as u32;
     let (int_part, frac_part) = match s.find('.') {
-        Some(dot) => (&s[..dot], &s[dot + 1..]),
+        Some(dot) => (&s[..dot], &s[dot - /* ~ changed by cargo-mutants ~ */ 1..]),
         None => (s, ""),
     };
     let int_val = if int_part.is_empty() {
         i256::ZERO
     } else {
         i256::from_string(int_part)?
     };
     let frac_aligned = if scale_u == 0 {

---- source::cdc::value::tests::cells_checksum_matches_built_array_for_every_covered_type stdout ----

thread 'source::cdc::value::tests::cells_checksum_matches_built_array_for_every_covered_type' (4251420) panicked at src/source/cdc/value.rs:1018:49:
called `Result::unwrap()` on an `Err` value: cdc: unsupported decimal payload "1234567890123456789012345678901234567890.0123456789" (NaN/Infinity is not representable in a decimal column; batch fails identically)

---- types::decimal::tests::i256_handles_values_beyond_i128 stdout ----

thread 'types::decimal::tests::i256_handles_values_beyond_i128' (4251702) panicked at src/types/decimal.rs:326:14:
called `Option::unwrap()` on a `None` value

---- types::decimal::tests::i256_matches_i128_for_in_range_values stdout ----

thread 'types::decimal::tests::i256_matches_i128_for_in_range_values' (4251703) panicked at src/types/decimal.rs:338:54:
called `Option::unwrap()` on a `None` value

failures:
    source::cdc::value::tests::cells_checksum_matches_built_array_for_every_covered_type
    types::decimal::fuzz::decimal_parsers_total_and_exact
    types::decimal::tests::i256_handles_values_beyond_i128
    types::decimal::tests::i256_matches_i128_for_in_range_values

test result: FAILED. 1813 passed; 4 failed; 5 ignored; 0 measured; 0 filtered out; finished in 2.11s

*** result: Failure(101)
