*** src/types/decimal.rs:152:35: replace == with != in decimal_str_to_scaled_i256

*** mutation diff:
--- src/types/decimal.rs
+++ replace == with != in decimal_str_to_scaled_i256
@@ -144,17 +144,17 @@
         Some(dot) => (&s[..dot], &s[dot + 1..]),
         None => (s, ""),
     };
     let int_val = if int_part.is_empty() {
         i256::ZERO
     } else {
         i256::from_string(int_part)?
     };
-    let frac_aligned = if scale_u == 0 {
+    let frac_aligned = if scale_u != /* ~ changed by cargo-mutants ~ */ 0 {
         i256::ZERO
     } else if frac_part.len() < scale_u as usize {
         let mut buf = String::with_capacity(scale_u as usize);
         buf.push_str(frac_part);
         for _ in 0..(scale_u as usize - frac_part.len()) {
             buf.push('0');
         }
         i256::from_string(&buf)?

---- types::decimal::tests::i256_handles_values_beyond_i128 stdout ----

thread 'types::decimal::tests::i256_handles_values_beyond_i128' (3871011) panicked at src/types/decimal.rs:321:48:
called `Option::unwrap()` on a `None` value

---- types::decimal::tests::i256_matches_i128_for_in_range_values stdout ----

thread 'types::decimal::tests::i256_matches_i128_for_in_range_values' (3871012) panicked at src/types/decimal.rs:337:13:
assertion `left == right` failed: i256 and i128 must agree for in-range value 123.45
  left: 12300
 right: 12345

---- types::decimal::fuzz::decimal_parsers_total_and_exact stdout ----

thread 'types::decimal::fuzz::decimal_parsers_total_and_exact' (3871008) panicked at src/types/decimal.rs:371:5:
Test failed: assertion failed: `(left == right)` 
  left: `Some(0)`,
 right: `Some(1)` at src/types/decimal.rs:393.
minimal failing input: junk = "", int_part = 0, frac = 1, neg = false
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    types::decimal::fuzz::decimal_parsers_total_and_exact
    types::decimal::tests::i256_handles_values_beyond_i128
    types::decimal::tests::i256_matches_i128_for_in_range_values

test result: FAILED. 1814 passed; 3 failed; 5 ignored; 0 measured; 0 filtered out; finished in 1.04s

*** result: Failure(101)
