*** src/types/decimal.rs:154:31: replace < with > in decimal_str_to_scaled_i256

*** mutation diff:
--- src/types/decimal.rs
+++ replace < with > in decimal_str_to_scaled_i256
@@ -146,17 +146,17 @@
     };
     let int_val = if int_part.is_empty() {
         i256::ZERO
     } else {
         i256::from_string(int_part)?
     };
     let frac_aligned = if scale_u == 0 {
         i256::ZERO
-    } else if frac_part.len() < scale_u as usize {
+    } else if frac_part.len() > /* ~ changed by cargo-mutants ~ */ scale_u as usize {
         let mut buf = String::with_capacity(scale_u as usize);
         buf.push_str(frac_part);
         for _ in 0..(scale_u as usize - frac_part.len()) {
             buf.push('0');
         }
         i256::from_string(&buf)?
     } else {
         i256::from_string(frac_part.get(..scale_u as usize)?)?

---- types::decimal::fuzz::decimal_parsers_total_and_exact stdout ----

thread 'types::decimal::fuzz::decimal_parsers_total_and_exact' (3886093) panicked at src/types/decimal.rs:157:21:
attempt to subtract with overflow

thread 'types::decimal::fuzz::decimal_parsers_total_and_exact' (3886093) panicked at src/types/decimal.rs:157:21:
attempt to subtract with overflow

thread 'types::decimal::fuzz::decimal_parsers_total_and_exact' (3886093) panicked at src/types/decimal.rs:157:21:
attempt to subtract with overflow

thread 'types::decimal::fuzz::decimal_parsers_total_and_exact' (3886093) panicked at src/types/decimal.rs:157:21:
attempt to subtract with overflow

failures:
    types::decimal::fuzz::decimal_parsers_total_and_exact

test result: FAILED. 1816 passed; 1 failed; 5 ignored; 0 measured; 0 filtered out; finished in 1.02s

*** result: Failure(101)
