*** src/types/decimal.rs:169:24: delete - in decimal_str_to_scaled_i256

*** mutation diff:
--- src/types/decimal.rs
+++ delete - in decimal_str_to_scaled_i256
@@ -161,17 +161,17 @@
     } else {
         i256::from_string(frac_part.get(..scale_u as usize)?)?
     };
 
     let scale_factor = pow10_i256(scale_u)?;
     let result = int_val
         .checked_mul(scale_factor)?
         .checked_add(frac_aligned)?;
-    Some(if negative { -result } else { result })
+    Some(if negative {  /* ~ changed by cargo-mutants ~ */result } else { result })
 }
 
 /// Scale an integer (already widened to `i128`) by `10^scale` into `i256` — the
 /// `Decimal256` analogue of the source drivers' `scale_int_to_i128`. `None` on
 /// negative scale or `i256` overflow.
 pub fn scale_int_to_i256(v: i128, scale: i8) -> Option<i256> {
     if scale < 0 {
         return None;

---- types::decimal::fuzz::decimal_parsers_total_and_exact stdout ----

thread 'types::decimal::fuzz::decimal_parsers_total_and_exact' (4310872) panicked at src/types/decimal.rs:371:5:
Test failed: assertion failed: `(left == right)` 
  left: `Some(1)`,
 right: `Some(-1)` at src/types/decimal.rs:393.
minimal failing input: junk = "", int_part = 0, frac = 1, neg = true
	successes: 0
	local rejects: 0
	global rejects: 0

---- types::decimal::tests::i256_matches_i128_for_in_range_values stdout ----

thread 'types::decimal::tests::i256_matches_i128_for_in_range_values' (4310876) panicked at src/types/decimal.rs:337:13:
assertion `left == right` failed: i256 and i128 must agree for in-range value -1.23
  left: 123
 right: -123

failures:
    types::decimal::fuzz::decimal_parsers_total_and_exact
    types::decimal::tests::i256_matches_i128_for_in_range_values

test result: FAILED. 1815 passed; 2 failed; 5 ignored; 0 measured; 0 filtered out; finished in 1.77s

*** result: Failure(101)
