*** src/types/decimal.rs:176:14: replace < with > in scale_int_to_i256

*** mutation diff:
--- src/types/decimal.rs
+++ replace < with > in scale_int_to_i256
@@ -168,17 +168,17 @@
         .checked_add(frac_aligned)?;
     Some(if negative { -result } else { result })
 }
 
 /// Scale an integer (already widened to `i128`) by `10^scale` into `i256` — the
 /// `Decimal256` analogue of the source drivers' `scale_int_to_i128`. `None` on
 /// negative scale or `i256` overflow.
 pub fn scale_int_to_i256(v: i128, scale: i8) -> Option<i256> {
-    if scale < 0 {
+    if scale > /* ~ changed by cargo-mutants ~ */ 0 {
         return None;
     }
     i256::from_i128(v).checked_mul(pow10_i256(scale as u32)?)
 }
 
 /// `10^n` as `i256` (up to 10^76, the `Decimal256` scale ceiling); `None` if it
 /// would exceed `i256`. Repeated `checked_mul` rather than the old
 /// `format!("1{0:0}")` + `i256::from_string` — no per-value string allocation

---- types::decimal::tests::scale_int_to_i256_scales_beyond_i128 stdout ----

thread 'types::decimal::tests::scale_int_to_i256_scales_beyond_i128' (3949753) panicked at src/types/decimal.rs:348:9:
assertion failed: scale_int_to_i256(u64::MAX as i128, 30).is_some()

failures:
    types::decimal::tests::scale_int_to_i256_scales_beyond_i128

test result: FAILED. 1816 passed; 1 failed; 5 ignored; 0 measured; 0 filtered out; finished in 1.01s

*** result: Failure(101)
