*** src/types/decimal.rs:176:14: replace < with == in scale_int_to_i256

*** mutation diff:
--- src/types/decimal.rs
+++ replace < with == in scale_int_to_i256
@@ -168,17 +168,17 @@
         .checked_add(frac_aligned)?;
     Some(if negative { -result } else { result })
 }
 
 /// Scale an integer (already widened to `i128`) by `10^scale` into `i256` — the
 /// `Decimal256` analogue of the source drivers' `scale_int_to_i128`. `None` on
 /// negative scale or `i256` overflow.
 pub fn scale_int_to_i256(v: i128, scale: i8) -> Option<i256> {
-    if scale < 0 {
+    if scale == /* ~ changed by cargo-mutants ~ */ 0 {
         return None;
     }
     i256::from_i128(v).checked_mul(pow10_i256(scale as u32)?)
 }
 
 /// `10^n` as `i256` (up to 10^76, the `Decimal256` scale ceiling); `None` if it
 /// would exceed `i256`. Repeated `checked_mul` rather than the old
 /// `format!("1{0:0}")` + `i256::from_string` — no per-value string allocation

*** result: Success
