*** src/types/decimal.rs:187:5: replace pow10_i256 -> Option<i256> with None

*** mutation diff:
--- src/types/decimal.rs
+++ replace pow10_i256 -> Option<i256> with None
@@ -179,22 +179,17 @@
     i256::from_i128(v).checked_mul(pow10_i256(scale as u32)?)
 }
 
 /// `10^n` as `i256` (up to 10^76, the `Decimal256` scale ceiling); `None` if it
 /// would exceed `i256`. Repeated `checked_mul` rather than the old
 /// `format!("1{0:0}")` + `i256::from_string` — no per-value string allocation
 /// or parse on the Decimal256 scale path; same overflow contract.
 fn pow10_i256(n: u32) -> Option<i256> {
-    let ten = i256::from_i128(10);
-    let mut acc = i256::from_i128(1);
-    for _ in 0..n {
-        acc = acc.checked_mul(ten)?;
-    }
-    Some(acc)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn scaled_to_str_roundtrip_financial() {

---- source::cdc::value::tests::cells_checksum_matches_built_array_for_every_covered_type stdout ----

thread 'source::cdc::value::tests::cells_checksum_matches_built_array_for_every_covered_type' (4361273) panicked at src/source/cdc/value.rs:1018:49:
called `Result::unwrap()` on an `Err` value: cdc: unsupported decimal payload "1234567890123456789012345678901234567890.0123456789" (NaN/Infinity is not representable in a decimal column; batch fails identically)

---- types::decimal::fuzz::decimal_parsers_total_and_exact stdout ----

thread 'types::decimal::fuzz::decimal_parsers_total_and_exact' (4361626) panicked at src/types/decimal.rs:366:5:
Test failed: assertion failed: `(left == right)` 
  left: `None`,
 right: `Some(0)` at src/types/decimal.rs:388.
minimal failing input: junk = "", int_part = 0, frac = 0, neg = false
	successes: 0
	local rejects: 0
	global rejects: 0

---- types::decimal::tests::i256_handles_values_beyond_i128 stdout ----

thread 'types::decimal::tests::i256_handles_values_beyond_i128' (4361631) panicked at src/types/decimal.rs:316:48:
called `Option::unwrap()` on a `None` value

failures:
    source::cdc::value::tests::cells_checksum_matches_built_array_for_every_covered_type
    types::decimal::fuzz::decimal_parsers_total_and_exact
    types::decimal::tests::i256_handles_values_beyond_i128
    types::decimal::tests::i256_matches_i128_for_in_range_values
    types::decimal::tests::pow10_i256_matches_string_form_and_respects_ceiling
    types::decimal::tests::scale_int_to_i256_scales_beyond_i128

test result: FAILED. 1811 passed; 6 failed; 5 ignored; 0 measured; 0 filtered out; finished in 2.45s

*** result: Failure(101)
