*** src/types/decimal.rs:187:5: replace pow10_i256 -> Option<i256> with Some(Default::default())

*** mutation diff:
--- src/types/decimal.rs
+++ replace pow10_i256 -> Option<i256> with Some(Default::default())
@@ -179,22 +179,17 @@
     i256::from_i128(v).checked_mul(pow10_i256(scale as u32)?)
 }
 
 /// `10^n` as `i256` (up to 10^76, the `Decimal256` scale ceiling); `None` if it
 /// would exceed `i256`. Repeated `checked_mul` rather than the old
 /// `format!("1{0:0}")` + `i256::from_string` — no per-value string allocation
 /// or parse on the Decimal256 scale path; same overflow contract.
 fn pow10_i256(n: u32) -> Option<i256> {
-    let ten = i256::from_i128(10);
-    let mut acc = i256::from_i128(1);
-    for _ in 0..n {
-        acc = acc.checked_mul(ten)?;
-    }
-    Some(acc)
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn scaled_to_str_roundtrip_financial() {

---- types::decimal::tests::i256_handles_values_beyond_i128 stdout ----

thread 'types::decimal::tests::i256_handles_values_beyond_i128' (4368286) panicked at src/types/decimal.rs:315:9:
assertion `left == right` failed
  left: 0
 right: 123456789012345678901234567890123456789012345

---- types::decimal::tests::i256_matches_i128_for_in_range_values stdout ----

thread 'types::decimal::tests::i256_matches_i128_for_in_range_values' (4368287) panicked at src/types/decimal.rs:332:13:
assertion `left == right` failed: i256 and i128 must agree for in-range value 123.45
  left: 45
 right: 12345

---- types::decimal::tests::pow10_i256_matches_string_form_and_respects_ceiling stdout ----

thread 'types::decimal::tests::pow10_i256_matches_string_form_and_respects_ceiling' (4368293) panicked at src/types/decimal.rs:355:13:
assertion `left == right` failed: 10^0 mismatch
  left: Some(0)
 right: Some(1)

failures:
    types::decimal::fuzz::decimal_parsers_total_and_exact
    types::decimal::tests::i256_handles_values_beyond_i128
    types::decimal::tests::i256_matches_i128_for_in_range_values
    types::decimal::tests::pow10_i256_matches_string_form_and_respects_ceiling
    types::decimal::tests::scale_int_to_i256_scales_beyond_i128

test result: FAILED. 1812 passed; 5 failed; 5 ignored; 0 measured; 0 filtered out; finished in 2.71s

*** result: Failure(101)
