*** src/types/decimal.rs:38:14: replace < with <= in scaled_i128_to_decimal_str

*** mutation diff:
--- src/types/decimal.rs
+++ replace < with <= in scaled_i128_to_decimal_str
@@ -30,17 +30,17 @@
 /// assert_eq!(decimal_str_to_scaled_i128("123.45",  2), Some(12345));
 /// assert_eq!(decimal_str_to_scaled_i128("0.10",    2), Some(10));
 /// assert_eq!(decimal_str_to_scaled_i128("-1.23",   2), Some(-123));
 /// assert_eq!(decimal_str_to_scaled_i128("1200",   -2), Some(12));
 /// assert_eq!(decimal_str_to_scaled_i128("",        2), None);
 /// ```
 /// Format a scaled `Decimal128` value as exact decimal text (no float).
 pub fn scaled_i128_to_decimal_str(value: i128, scale: i8) -> String {
-    if scale < 0 {
+    if scale <= /* ~ changed by cargo-mutants ~ */ 0 {
         let factor = 10i128.pow(scale.unsigned_abs() as u32);
         return (value * factor).to_string();
     }
     let scale_u = scale as u32;
     if scale_u == 0 {
         return value.to_string();
     }
     let factor = 10i128.pow(scale_u);

*** result: Success
