*** src/types/decimal.rs:38:14: replace < with > in scaled_i128_to_decimal_str

*** mutation diff:
--- src/types/decimal.rs
+++ replace < with > in scaled_i128_to_decimal_str
@@ -30,17 +30,17 @@
 /// assert_eq!(decimal_str_to_scaled_i128("123.45",  2), Some(12345));
 /// assert_eq!(decimal_str_to_scaled_i128("0.10",    2), Some(10));
 /// assert_eq!(decimal_str_to_scaled_i128("-1.23",   2), Some(-123));
 /// assert_eq!(decimal_str_to_scaled_i128("1200",   -2), Some(12));
 /// assert_eq!(decimal_str_to_scaled_i128("",        2), None);
 /// ```
 /// Format a scaled `Decimal128` value as exact decimal text (no float).
 pub fn scaled_i128_to_decimal_str(value: i128, scale: i8) -> String {
-    if scale < 0 {
+    if scale > /* ~ changed by cargo-mutants ~ */ 0 {
         let factor = 10i128.pow(scale.unsigned_abs() as u32);
         return (value * factor).to_string();
     }
     let scale_u = scale as u32;
     if scale_u == 0 {
         return value.to_string();
     }
     let factor = 10i128.pow(scale_u);

---- format::csv::tests::decimal128_writes_exact_text stdout ----

thread 'format::csv::tests::decimal128_writes_exact_text' (3997418) panicked at src/format/csv.rs:379:9:
assertion `left == right` failed
  left: "1000"
 right: "0.10"

---- types::decimal::tests::scaled_to_str_roundtrip_financial stdout ----

thread 'types::decimal::tests::scaled_to_str_roundtrip_financial' (3998821) panicked at src/types/decimal.rs:201:9:
assertion `left == right` failed
  left: "1000"
 right: "0.10"

failures:
    format::csv::tests::decimal128_writes_exact_text
    types::decimal::tests::scaled_to_str_roundtrip_financial

test result: FAILED. 1815 passed; 2 failed; 5 ignored; 0 measured; 0 filtered out; finished in 1.03s

*** result: Failure(101)
