*** src/types/decimal.rs:38:5: replace scaled_i128_to_decimal_str -> String with String::new()

*** mutation diff:
--- src/types/decimal.rs
+++ replace scaled_i128_to_decimal_str -> String with String::new()
@@ -30,34 +30,17 @@
 /// assert_eq!(decimal_str_to_scaled_i128("123.45",  2), Some(12345));
 /// assert_eq!(decimal_str_to_scaled_i128("0.10",    2), Some(10));
 /// assert_eq!(decimal_str_to_scaled_i128("-1.23",   2), Some(-123));
 /// assert_eq!(decimal_str_to_scaled_i128("1200",   -2), Some(12));
 /// assert_eq!(decimal_str_to_scaled_i128("",        2), None);
 /// ```
 /// Format a scaled `Decimal128` value as exact decimal text (no float).
 pub fn scaled_i128_to_decimal_str(value: i128, scale: i8) -> String {
-    if scale < 0 {
-        let factor = 10i128.pow(scale.unsigned_abs() as u32);
-        return (value * factor).to_string();
-    }
-    let scale_u = scale as u32;
-    if scale_u == 0 {
-        return value.to_string();
-    }
-    let factor = 10i128.pow(scale_u);
-    let negative = value < 0;
-    let abs = value.abs();
-    let int_part = abs / factor;
-    let frac = abs % factor;
-    format!(
-        "{sign}{int_part}.{frac:0width$}",
-        sign = if negative { "-" } else { "" },
-        width = scale_u as usize
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn decimal_str_to_scaled_i128(s: &str, scale: i8) -> Option<i128> {
     let s = s.trim();
     if s.is_empty() {
         return None;
     }

---- format::csv::tests::decimal128_writes_exact_text stdout ----

thread 'format::csv::tests::decimal128_writes_exact_text' (3976525) panicked at src/format/csv.rs:379:9:
assertion `left == right` failed
  left: ""
 right: "0.10"

---- types::decimal::tests::scaled_to_str_roundtrip_financial stdout ----

thread 'types::decimal::tests::scaled_to_str_roundtrip_financial' (3977885) panicked at src/types/decimal.rs:184:9:
assertion `left == right` failed
  left: ""
 right: "0.10"

failures:
    format::csv::tests::decimal128_writes_exact_text
    types::decimal::tests::scaled_to_str_roundtrip_financial

test result: FAILED. 1815 passed; 2 failed; 5 ignored; 0 measured; 0 filtered out; finished in 0.98s

*** result: Failure(101)
