*** src/types/decimal.rs:43:16: replace == with != in scaled_i128_to_decimal_str

*** mutation diff:
--- src/types/decimal.rs
+++ replace == with != in scaled_i128_to_decimal_str
@@ -35,17 +35,17 @@
 /// ```
 /// Format a scaled `Decimal128` value as exact decimal text (no float).
 pub fn scaled_i128_to_decimal_str(value: i128, scale: i8) -> String {
     if scale < 0 {
         let factor = 10i128.pow(scale.unsigned_abs() as u32);
         return (value * factor).to_string();
     }
     let scale_u = scale as u32;
-    if scale_u == 0 {
+    if scale_u != /* ~ changed by cargo-mutants ~ */ 0 {
         return value.to_string();
     }
     let factor = 10i128.pow(scale_u);
     let negative = value < 0;
     let abs = value.abs();
     let int_part = abs / factor;
     let frac = abs % factor;
     format!(

---- format::csv::tests::decimal128_writes_exact_text stdout ----

thread 'format::csv::tests::decimal128_writes_exact_text' (3620591) panicked at src/format/csv.rs:379:9:
assertion `left == right` failed
  left: "10"
 right: "0.10"

---- types::decimal::tests::scaled_to_str_roundtrip_financial stdout ----

thread 'types::decimal::tests::scaled_to_str_roundtrip_financial' (3621967) panicked at src/types/decimal.rs:201:9:
assertion `left == right` failed
  left: "10"
 right: "0.10"

failures:
    format::csv::tests::decimal128_writes_exact_text
    types::decimal::tests::scaled_to_str_roundtrip_financial

test result: FAILED. 1815 passed; 2 failed; 5 ignored; 0 measured; 0 filtered out; finished in 1.03s

*** result: Failure(101)
