*** src/types/decimal.rs:47:26: replace < with == in scaled_i128_to_decimal_str

*** mutation diff:
--- src/types/decimal.rs
+++ replace < with == in scaled_i128_to_decimal_str
@@ -39,17 +39,17 @@
         let factor = 10i128.pow(scale.unsigned_abs() as u32);
         return (value * factor).to_string();
     }
     let scale_u = scale as u32;
     if scale_u == 0 {
         return value.to_string();
     }
     let factor = 10i128.pow(scale_u);
-    let negative = value < 0;
+    let negative = value == /* ~ changed by cargo-mutants ~ */ 0;
     let abs = value.abs();
     let int_part = abs / factor;
     let frac = abs % factor;
     format!(
         "{sign}{int_part}.{frac:0width$}",
         sign = if negative { "-" } else { "" },
         width = scale_u as usize
     )

---- types::decimal::tests::scaled_to_str_roundtrip_financial stdout ----

thread 'types::decimal::tests::scaled_to_str_roundtrip_financial' (4038149) panicked at src/types/decimal.rs:203:9:
assertion `left == right` failed
  left: "1.23"
 right: "-1.23"

failures:
    types::decimal::tests::scaled_to_str_roundtrip_financial

test result: FAILED. 1816 passed; 1 failed; 5 ignored; 0 measured; 0 filtered out; finished in 1.08s

*** result: Failure(101)
