*** src/types/decimal.rs:49:24: replace / with * in scaled_i128_to_decimal_str

*** mutation diff:
--- src/types/decimal.rs
+++ replace / with * in scaled_i128_to_decimal_str
@@ -41,17 +41,17 @@
     }
     let scale_u = scale as u32;
     if scale_u == 0 {
         return value.to_string();
     }
     let factor = 10i128.pow(scale_u);
     let negative = value < 0;
     let abs = value.abs();
-    let int_part = abs / factor;
+    let int_part = abs * /* ~ changed by cargo-mutants ~ */ factor;
     let frac = abs % factor;
     format!(
         "{sign}{int_part}.{frac:0width$}",
         sign = if negative { "-" } else { "" },
         width = scale_u as usize
     )
 }

---- format::csv::tests::decimal128_writes_exact_text stdout ----

thread 'format::csv::tests::decimal128_writes_exact_text' (4065100) panicked at src/format/csv.rs:379:9:
assertion `left == right` failed
  left: "1000.10"
 right: "0.10"

---- types::decimal::tests::scaled_to_str_roundtrip_financial stdout ----

thread 'types::decimal::tests::scaled_to_str_roundtrip_financial' (4066464) panicked at src/types/decimal.rs:201:9:
assertion `left == right` failed
  left: "1000.10"
 right: "0.10"

failures:
    format::csv::tests::decimal128_writes_exact_text
    types::decimal::tests::scaled_to_str_roundtrip_financial

test result: FAILED. 1815 passed; 2 failed; 5 ignored; 0 measured; 0 filtered out; finished in 1.11s

*** result: Failure(101)
