*** src/types/decimal.rs:59:5: replace decimal_str_to_scaled_i128 -> Option<i128> with Some(0)

*** mutation diff:
--- src/types/decimal.rs
+++ replace decimal_str_to_scaled_i128 -> Option<i128> with Some(0)
@@ -51,75 +51,17 @@
     format!(
         "{sign}{int_part}.{frac:0width$}",
         sign = if negative { "-" } else { "" },
         width = scale_u as usize
     )
 }
 
 pub fn decimal_str_to_scaled_i128(s: &str, scale: i8) -> Option<i128> {
-    let s = s.trim();
-    if s.is_empty() {
-        return None;
-    }
-
-    let negative = s.starts_with('-');
-    let s = if negative {
-        &s[1..]
-    } else {
-        s.trim_start_matches('+')
-    };
-
-    if scale < 0 {
-        // Negative scale: the stored integer represents multiples of 10^|scale|.
-        // E.g. scale=-2 means the column stores whole hundreds: "1200" → 12.
-        let divisor = 10i128.pow(scale.unsigned_abs() as u32);
-        let int_val: i128 = s.split('.').next()?.trim().parse().ok()?;
-        let result = int_val.checked_div(divisor)?;
-        return Some(if negative { -result } else { result });
-    }
-
-    let scale_u = scale as u32;
-
-    // Split on the decimal point (may be absent for integer-valued decimals).
-    let (int_part, frac_part) = if let Some(dot) = s.find('.') {
-        (&s[..dot], &s[dot + 1..])
-    } else {
-        (s, "")
-    };
-
-    let int_val: i128 = if int_part.is_empty() {
-        0
-    } else {
-        int_part.parse().ok()?
-    };
-
-    let frac_aligned: i128 = if scale_u == 0 {
-        0
-    } else if frac_part.len() < scale_u as usize {
-        // Pad right with zeros: "0.1" with scale=2 → frac "10" → 10
-        let mut buf = String::with_capacity(scale_u as usize);
-        buf.push_str(frac_part);
-        for _ in 0..(scale_u as usize - frac_part.len()) {
-            buf.push('0');
-        }
-        buf.parse().ok()?
-    } else {
-        // Truncate to exactly `scale` digits. If the source column truly has
-        // scale=2 and a DB value arrives with more digits, that is either a
-        // type mismatch or a DB rounding artefact — we preserve the declared
-        // scale rather than silently extending it.
-        frac_part.get(..scale_u as usize)?.parse().ok()?
-    };
-
-    let scale_factor = 10i128.pow(scale_u);
-    let result = int_val
-        .checked_mul(scale_factor)?
-        .checked_add(frac_aligned)?;
-    Some(if negative { -result } else { result })
+    Some(0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// `Decimal256` analogue of [`decimal_str_to_scaled_i128`] — parses straight
 /// into `i256` so values beyond `i128` (precision 39–76) are not truncated.
 /// Returns `None` for empty / non-numeric strings or `i256` overflow.
 pub fn decimal_str_to_scaled_i256(s: &str, scale: i8) -> Option<i256> {
     let s = s.trim();
     if s.is_empty() {

---- format::csv::tests::decimal128_writes_exact_text stdout ----

thread 'format::csv::tests::decimal128_writes_exact_text' (3682959) panicked at src/format/csv.rs:385:9:
assertion `left == right` failed
  left: "0.00"
 right: "999999999999.99"

---- source::cdc::value::tests::decimal_parse_is_lossless stdout ----

thread 'source::cdc::value::tests::decimal_parse_is_lossless' (3684027) panicked at src/source/cdc/value.rs:1127:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(15005)

---- types::decimal::fuzz::decimal_parsers_total_and_exact stdout ----

thread 'types::decimal::fuzz::decimal_parsers_total_and_exact' (3684306) panicked at src/types/decimal.rs:313:5:
Test failed: assertion failed: `(left == right)` 
  left: `Some(0)`,
 right: `Some(1)` at src/types/decimal.rs:334.
minimal failing input: junk = "", int_part = 0, frac = 1, neg = false
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format::csv::tests::decimal128_writes_exact_text
    source::cdc::value::tests::decimal_parse_is_lossless
    types::decimal::fuzz::decimal_parsers_total_and_exact
    types::decimal::tests::frac_shorter_than_scale_is_right_padded
    types::decimal::tests::golden_test_payment_values
    types::decimal::tests::i256_handles_values_beyond_i128
    types::decimal::tests::i256_matches_i128_for_in_range_values
    types::decimal::tests::integer_valued_decimal_with_nonzero_scale
    types::decimal::tests::large_precision_near_i128_boundary
    types::decimal::tests::negative_scale_represents_large_round_numbers
    types::decimal::tests::non_numeric_string_returns_none
    types::decimal::tests::null_like_empty_string_returns_none

test result: FAILED. 1802 passed; 15 failed; 5 ignored; 0 measured; 0 filtered out; finished in 0.99s

*** result: Failure(101)
