*** src/types/decimal.rs:71:14: replace < with == in decimal_str_to_scaled_i128

*** mutation diff:
--- src/types/decimal.rs
+++ replace < with == in decimal_str_to_scaled_i128
@@ -63,17 +63,17 @@
 
     let negative = s.starts_with('-');
     let s = if negative {
         &s[1..]
     } else {
         s.trim_start_matches('+')
     };
 
-    if scale < 0 {
+    if scale == /* ~ changed by cargo-mutants ~ */ 0 {
         // Negative scale: the stored integer represents multiples of 10^|scale|.
         // E.g. scale=-2 means the column stores whole hundreds: "1200" → 12.
         let divisor = 10i128.pow(scale.unsigned_abs() as u32);
         let int_val: i128 = s.split('.').next()?.trim().parse().ok()?;
         let result = int_val.checked_div(divisor)?;
         return Some(if negative { -result } else { result });
     }

*** result: Timeout
