*** src/types/decimal.rs:84:28: replace + with - in decimal_str_to_scaled_i128

*** mutation diff:
--- src/types/decimal.rs
+++ replace + with - in decimal_str_to_scaled_i128
@@ -76,17 +76,17 @@
         let result = int_val.checked_div(divisor)?;
         return Some(if negative { -result } else { result });
     }
 
     let scale_u = scale as u32;
 
     // Split on the decimal point (may be absent for integer-valued decimals).
     let (int_part, frac_part) = if let Some(dot) = s.find('.') {
-        (&s[..dot], &s[dot + 1..])
+        (&s[..dot], &s[dot - /* ~ changed by cargo-mutants ~ */ 1..])
     } else {
         (s, "")
     };
 
     let int_val: i128 = if int_part.is_empty() {
         0
     } else {
         int_part.parse().ok()?

---- format::csv::tests::decimal128_writes_exact_text stdout ----

thread 'format::csv::tests::decimal128_writes_exact_text' (4143705) panicked at src/format/csv.rs:381:85:
called `Option::unwrap()` on a `None` value

---- source::cdc::value::tests::cells_checksum_matches_built_array_for_every_covered_type stdout ----

thread 'source::cdc::value::tests::cells_checksum_matches_built_array_for_every_covered_type' (4144772) panicked at src/source/cdc/value.rs:1018:49:
called `Result::unwrap()` on an `Err` value: cdc: unsupported decimal payload "999999999999.99" (NaN/Infinity is not representable in a decimal column; batch fails identically)

---- source::cdc::value::tests::decimal_parse_is_lossless stdout ----

thread 'source::cdc::value::tests::decimal_parse_is_lossless' (4144773) panicked at src/source/cdc/value.rs:1127:9:
assertion `left == right` failed
  left: None
 right: Some(15005)

failures:
    format::csv::tests::decimal128_writes_exact_text
    source::cdc::value::tests::cells_checksum_matches_built_array_for_every_covered_type
    source::cdc::value::tests::decimal_parse_is_lossless
    types::decimal::fuzz::decimal_parsers_total_and_exact
    types::decimal::tests::frac_shorter_than_scale_is_right_padded
    types::decimal::tests::golden_test_payment_values
    types::decimal::tests::i256_matches_i128_for_in_range_values
    types::decimal::tests::standard_financial_values

test result: FAILED. 1809 passed; 8 failed; 5 ignored; 0 measured; 0 filtered out; finished in 1.64s

*** result: Failure(101)
