*** src/types/decimal.rs:95:41: replace == with != in decimal_str_to_scaled_i128

*** mutation diff:
--- src/types/decimal.rs
+++ replace == with != in decimal_str_to_scaled_i128
@@ -87,17 +87,17 @@
     };
 
     let int_val: i128 = if int_part.is_empty() {
         0
     } else {
         int_part.parse().ok()?
     };
 
-    let frac_aligned: i128 = if scale_u == 0 {
+    let frac_aligned: i128 = if scale_u != /* ~ changed by cargo-mutants ~ */ 0 {
         0
     } else if frac_part.len() < scale_u as usize {
         // Pad right with zeros: "0.1" with scale=2 → frac "10" → 10
         let mut buf = String::with_capacity(scale_u as usize);
         buf.push_str(frac_part);
         for _ in 0..(scale_u as usize - frac_part.len()) {
             buf.push('0');
         }

---- format::csv::tests::decimal128_writes_exact_text stdout ----

thread 'format::csv::tests::decimal128_writes_exact_text' (4156322) panicked at src/format/csv.rs:385:9:
assertion `left == right` failed
  left: "999999999999.00"
 right: "999999999999.99"

---- source::cdc::value::tests::decimal_parse_is_lossless stdout ----

thread 'source::cdc::value::tests::decimal_parse_is_lossless' (4157393) panicked at src/source/cdc/value.rs:1127:9:
assertion `left == right` failed
  left: Some(15000)
 right: Some(15005)

---- types::decimal::fuzz::decimal_parsers_total_and_exact stdout ----

thread 'types::decimal::fuzz::decimal_parsers_total_and_exact' (4157673) panicked at src/types/decimal.rs:371:5:
Test failed: assertion failed: `(left == right)` 
  left: `Some(0)`,
 right: `Some(1)` at src/types/decimal.rs:392.
minimal failing input: junk = "", int_part = 0, frac = 1, neg = false
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format::csv::tests::decimal128_writes_exact_text
    source::cdc::value::tests::decimal_parse_is_lossless
    types::decimal::fuzz::decimal_parsers_total_and_exact
    types::decimal::tests::frac_shorter_than_scale_is_right_padded
    types::decimal::tests::golden_test_payment_values
    types::decimal::tests::i256_matches_i128_for_in_range_values
    types::decimal::tests::large_precision_near_i128_boundary
    types::decimal::tests::standard_financial_values
    types::decimal::tests::value_beyond_i128_returns_none_not_panic
    types::decimal::tests::zero_scale_ignores_fractional_digits

test result: FAILED. 1807 passed; 10 failed; 5 ignored; 0 measured; 0 filtered out; finished in 1.48s

*** result: Failure(101)
