*** src/types/decimal.rs:97:31: replace < with > in decimal_str_to_scaled_i128

*** mutation diff:
--- src/types/decimal.rs
+++ replace < with > in decimal_str_to_scaled_i128
@@ -89,17 +89,17 @@
     let int_val: i128 = if int_part.is_empty() {
         0
     } else {
         int_part.parse().ok()?
     };
 
     let frac_aligned: i128 = if scale_u == 0 {
         0
-    } else if frac_part.len() < scale_u as usize {
+    } else if frac_part.len() > /* ~ changed by cargo-mutants ~ */ scale_u as usize {
         // Pad right with zeros: "0.1" with scale=2 → frac "10" → 10
         let mut buf = String::with_capacity(scale_u as usize);
         buf.push_str(frac_part);
         for _ in 0..(scale_u as usize - frac_part.len()) {
             buf.push('0');
         }
         buf.parse().ok()?
     } else {

---- source::cdc::value::tests::cells_checksum_matches_built_array_for_every_covered_type stdout ----

thread 'source::cdc::value::tests::cells_checksum_matches_built_array_for_every_covered_type' (4169580) panicked at src/source/cdc/value.rs:1018:49:
called `Result::unwrap()` on an `Err` value: cdc: unsupported decimal payload "-42" (NaN/Infinity is not representable in a decimal column; batch fails identically)

---- source::cdc::value::tests::decimal_parse_is_lossless stdout ----

thread 'source::cdc::value::tests::decimal_parse_is_lossless' (4169581) panicked at src/source/cdc/value.rs:1128:9:
assertion `left == right` failed
  left: None
 right: Some(-7500)

---- types::decimal::fuzz::decimal_parsers_total_and_exact stdout ----

thread 'types::decimal::fuzz::decimal_parsers_total_and_exact' (4169856) panicked at src/types/decimal.rs:101:21:
attempt to subtract with overflow

thread 'types::decimal::fuzz::decimal_parsers_total_and_exact' (4169856) panicked at src/types/decimal.rs:101:21:
attempt to subtract with overflow

thread 'types::decimal::fuzz::decimal_parsers_total_and_exact' (4169856) panicked at src/types/decimal.rs:101:21:
attempt to subtract with overflow

thread 'types::decimal::fuzz::decimal_parsers_total_and_exact' (4169856) panicked at src/types/decimal.rs:101:21:
attempt to subtract with overflow

failures:
    source::cdc::value::tests::cells_checksum_matches_built_array_for_every_covered_type
    source::cdc::value::tests::decimal_parse_is_lossless
    types::decimal::fuzz::decimal_parsers_total_and_exact
    types::decimal::tests::frac_shorter_than_scale_is_right_padded
    types::decimal::tests::integer_valued_decimal_with_nonzero_scale

test result: FAILED. 1812 passed; 5 failed; 5 ignored; 0 measured; 0 filtered out; finished in 1.93s

*** result: Failure(101)
