*** src/types/decimal.rs:97:31: replace < with <= in decimal_str_to_scaled_i128

*** mutation diff:
--- src/types/decimal.rs
+++ replace < with <= in decimal_str_to_scaled_i128
@@ -89,17 +89,17 @@
     let int_val: i128 = if int_part.is_empty() {
         0
     } else {
         int_part.parse().ok()?
     };
 
     let frac_aligned: i128 = if scale_u == 0 {
         0
-    } else if frac_part.len() < scale_u as usize {
+    } else if frac_part.len() <= /* ~ changed by cargo-mutants ~ */ scale_u as usize {
         // Pad right with zeros: "0.1" with scale=2 → frac "10" → 10
         let mut buf = String::with_capacity(scale_u as usize);
         buf.push_str(frac_part);
         for _ in 0..(scale_u as usize - frac_part.len()) {
             buf.push('0');
         }
         buf.parse().ok()?
     } else {

*** result: Success
